//Задание 1. Вариант 20. Выполнил Салищев Данил РИС-26-3б
#include <iostream> //Подключаю библиотеку управления вводом/выводом
using namespace std; //Использую пространство имен std

// Функция для float 
float Ff(float a, float b) {
    float sum = a + b;
    cout<<"sum = a+b:"<<sum;
    cout<<"(a+b)^4:"<<sum*sum*sum*sum;
    cout<<"(a^4+4*a^3*b):"<<(a * a * a * a + 4 * a * a * a * b);
    cout<<"(6*a^2*b^2+a*b^3+a^3*b):"<<(6 * a * a * b * b + 4 * a * b * b * b + b * b * b * b);
    return (sum * sum * sum * sum - (a * a * a * a + 4 * a * a * a * b)) / 
           (6 * a * a * b * b + 4 * a * b * b * b + b * b * b * b); //Функция возвращает результат
}

// Функция для double
double Fd(double a, double b) {
    double sum = a + b;
    cout<<"sum = a+b:"<<sum;
    cout<<"(a+b)^4:"<<sum*sum*sum*sum;
    cout<<"(a^4+4*a^3*b):"<<(a * a * a * a + 4 * a * a * a * b);
    cout<<"(6*a^2*b^2+a*b^3+a^3*b):"<<(6 * a * a * b * b + 4 * a * b * b * b + b * b * b * b);
    return (sum * sum * sum * sum - (a * a * a * a + 4 * a * a * a * b)) / 
           (6 * a * a * b * b + 4 * a * b * b * b + b * b * b * b); //Функция возвращает результат
}

int main() {
    float af = 100, bf = 0.001; //Задаю переменные в float
    double ad = 100, bd = 0.001; //Те же переменные в double
    
    cout << "Float type result: " << Ff(af, bf) << endl; //Вывод результата для float
    cout << "Double type result: " << Fd(ad, bd) << endl; //Вывод результата для double
    
    return 0; //возвращаем 0, показатель правильного выполнения программы
}
/* Объяснение результатов:
В нашей программе при расчете формулы с а = 100 и b = 0.001 ключевую роль играет разница в типах данных.
Типы float (4 байта) и double (8 байт) используют фиксированное число бит для мантиссы, поэтому дробные числа вроде 0.001 не могут быть записаны в двоичной памяти абсолютно точно.
Когда мы возводим в 4-ю степень сумму (a + b) и работаем с вычитанием больших степеней, у float из-за нехватки значащих цифр (всего около 7 знаков) накапливается погрешность.
У double мантисса в два раза длиннее (около 15–16 знаков), поэтому он удерживает точность вычислений гораздо стабильнее, что и объясняет разницу в итоговых результатах.
*/
