//Задание 2. Вариант 15. Выполнил Салищев Данил РИС-26-3б
#include <iostream> // Подключаем библиотеку для управления ввода/вывода
using namespace std; // Используем пространство имён std
#include <clocale> // Подключаем библиотеку для локализации

int main(){
    setlocale(LC_ALL, ".65001"); // Подключаем русскую локализацию для корректного вывода
    int n, m;
    cout << "Введите числа m и n: "; // Запрос на ввод данных
    cin >> n >> m; // Вводим числа с клавиатуры

    cout << endl << "1) (m-++n):" << (m-++n) << endl;  

    cout << "2) (++m>--n):" << (++m>--n) << endl;

    cout << "3) (--n<++m):" << (--n<++m) << endl;  

    return 0; // Возвращаем 0 как индикатор успешного завершения программы
}
/* Вывод: В результате выполнения всех операций переменная n возвращается к своему исходному значению (так как была и увеличена, и уменьшена),
а переменная m уменьшается на 1 из-за одиночного декремента. Главное отличие унарных операторов: 
  - постфиксный сначала использует текущее значение переменной в выражении, а уже потом изменяет его;
  - префиксный действует наоборот — сначала сразу меняет значение переменной, и только потом применяет его в вычислениях.
*/
